package FinalGameProjectPackage1;

public class commimt {

}
/**
 *	1.設定玩家人數，每個遊戲都要
 *	2.玩家計分系統
 *	data202306081248卡關，如何讓得分時可以改變標籤
 *  重啟記分板(label)無法顯示window.class.getEnterPanel()
 *	所有Class都是引用，沒有數值，只是一塊需要給值運作的殼
 *  修正，可以正確得到分數排行fraction ,keywin; 20230610181916
 *  20230611015840 完成讀秒王。開始設計分數系統
 *  20230611115005 完成得分機制
 * 	2023年6月11日1252 修正game1得分機制
 * 	2023年6月11日嘗試設計game的共同父親，失敗
 * 2023/06/11　想法:把Window抬到最高處，人數設定下降。
 * 	1658問題完成，準備開始框，以及遊戲流程
 * if_else無法判斷null改用try_catch G2F 2051 
 * 6/11 2133 ctrl+shift+f是自動排版!
 * 6/12 0851 遊戲2新增重新開始，開始設計遊戲3
 * 6/12 0950 註解互打流程 Game3
 * 6/12 1900 完成互打判斷
 * 06/12 2100準備重新開始與結束遊戲
 * 06/12 2230時間與按鍵組合 
 * 06/13 0250完成第三個遊戲
 * 
 * /
 */